In [3]:
import pandas as pd #doesnt have to be called pd but it is mainly called this

In [4]:
walrus_data = {'name': ['Antje', 'ET', 'Jocko'] ,
               'gender': ['Female','Male','Male'], 
               'weight': [2000,3400,3000]}

In [5]:
walruses = pd.DataFrame(walrus_data) #turns it into a data frame/ the cute chart lol

In [6]:
int(5.6)

5

In [5]:
walrus_parts = ['tusk','flipper']

In [6]:
walrus_parts.append('blubber')

In [7]:
walrus_parts

['tusk', 'flipper', 'blubber']

In [8]:
'Walruses are cool'.upper() #method that is specific to strings that makes it uppercase

'WALRUSES ARE COOL'

In [9]:
walruses

   gender   name  weight
0  Female  Antje    2000
1    Male     ET    3400
2    Male  Jocko    3000

In [10]:
#data frames uses the head method
walruses.head(2)

   gender   name  weight
0  Female  Antje    2000
1    Male     ET    3400

In [11]:
walruses.head()

   gender   name  weight
0  Female  Antje    2000
1    Male     ET    3400
2    Male  Jocko    3000

In [12]:
walruses.shape #pandas associates every attribute in the data frame

(3, 3)

In [13]:
walruses.head(2).shape #.shape is an attritbute and walruses.head is a data frame

(2, 3)

In [14]:
walruses.dtypes

gender    object
name      object
weight     int64
dtype: object

In [15]:
walruses['weight']

0    2000
1    3400
2    3000
Name: weight, dtype: int64

In [16]:
walruses['weight'].values

array([2000, 3400, 3000])

In [17]:
walruses['name']

0    Antje
1       ET
2    Jocko
Name: name, dtype: object

In [18]:
walruses[['name','gender']] #list inside accessing a column(use square brackets)

    name  gender
0  Antje  Female
1     ET    Male
2  Jocko    Male

In [19]:
#accessing rows/ .loc
walruses.loc[0]

gender    Female
name       Antje
weight      2000
Name: 0, dtype: object

In [20]:
walruses.loc[0,'name'] #giving data frame x,y coordinate/ row 0, name

'Antje'

In [21]:
walruses.loc[0,['name','gender']]

name       Antje
gender    Female
Name: 0, dtype: object

In [22]:
walruses.loc[[0,2],['name','gender']]

    name  gender
0  Antje  Female
2  Jocko    Male

In [7]:
walruses.set_index('name') #first set where it says name is not a column, we replaced it with the 0,2

       gender  weight
name
Antje  Female    2000
ET       Male    3400
Jocko    Male    3000

In [24]:
walruses #pandas methods dont change their data frame

   gender   name  weight
0  Female  Antje    2000
1    Male     ET    3400
2    Male  Jocko    3000

In [25]:
walruses = walruses.set_index('name')

In [26]:
walruses

       gender  weight
name
Antje  Female    2000
ET       Male    3400
Jocko    Male    3000

In [27]:
walruses = walruses.reset_index()

In [28]:
walruses

    name  gender  weight
0  Antje  Female    2000
1     ET    Male    3400
2  Jocko    Male    3000

In [29]:
walruses.set_index('name', inplace=True) #optional arguments

In [30]:
walruses

       gender  weight
name
Antje  Female    2000
ET       Male    3400
Jocko    Male    3000

In [31]:
walruses.loc['Antje']

gender    Female
weight      2000
Name: Antje, dtype: object

In [32]:
walruses.iloc[0] #.iloc is for integers

gender    Female
weight      2000
Name: Antje, dtype: object

# Vectorized operations

In [33]:
walruses['gender'] == 'Female'

name
Antje     True
ET       False
Jocko    False
Name: gender, dtype: bool

In [34]:
walruses['weight'] + 1 #take single column and add one to it

name
Antje    2001
ET       3401
Jocko    3001
Name: weight, dtype: int64

In [35]:
#dont write for loops for pandas data frames; better to write vectorized operations

In [36]:
walrus_food_consumption = pd.Series([60,150], index=['Antje', 'ET']) #antje at 60, Et ate 150

In [37]:
walrus_food_consumption

Antje     60
ET       150
dtype: int64

In [38]:
walrus_weight_today = walruses['weight'] + walrus_food_consumption

In [39]:
walrus_weight_today

Antje    2060.0
ET       3550.0
Jocko       NaN
dtype: float64

In [40]:
walrus_weight_today.fillna(3030)

Antje    2060.0
ET       3550.0
Jocko    3030.0
dtype: float64

In [41]:
walruses['gender'] == 'Female' #example of bool series

name
Antje     True
ET       False
Jocko    False
Name: gender, dtype: bool

In [42]:
walruses['weight_today'] = walrus_weight_today

In [43]:
walruses

       gender  weight  weight_today
name
Antje  Female    2000        2060.0
ET       Male    3400        3550.0
Jocko    Male    3000           NaN

In [44]:
walruses['weight']

name
Antje    2000
ET       3400
Jocko    3000
Name: weight, dtype: int64

In [45]:
walruses

       gender  weight  weight_today
name
Antje  Female    2000        2060.0
ET       Male    3400        3550.0
Jocko    Male    3000           NaN

In [46]:
walruses['gender'] == 'Female'

name
Antje     True
ET       False
Jocko    False
Name: gender, dtype: bool

In [47]:
walruses.iloc[2]

gender          Male
weight          3000
weight_today     NaN
Name: Jocko, dtype: object

In [48]:
walrus_is_female = (walruses['gender'] == 'Female')

In [49]:
walrus_is_female

name
Antje     True
ET       False
Jocko    False
Name: gender, dtype: bool

In [50]:
walruses[walrus_is_female]

       gender  weight  weight_today
name
Antje  Female    2000        2060.0

In [51]:
walruses

       gender  weight  weight_today
name
Antje  Female    2000        2060.0
ET       Male    3400        3550.0
Jocko    Male    3000           NaN

In [52]:
walruses[walruses['gender'] == 'Female']

       gender  weight  weight_today
name
Antje  Female    2000        2060.0

In [53]:
walruses['weight'] > 2500

name
Antje    False
ET        True
Jocko     True
Name: weight, dtype: bool

In [54]:
walruses[walruses['weight'] > 2500]

      gender  weight  weight_today
name
ET      Male    3400        3550.0
Jocko   Male    3000           NaN

In [55]:
walruses['gender'] != 'Female'

name
Antje    False
ET        True
Jocko     True
Name: gender, dtype: bool

In [56]:
(walruses['weight'] > 3000) & (walruses ['gender'] != 'Female')

name
Antje    False
ET        True
Jocko    False
dtype: bool

In [57]:
walruses[(walruses['weight'] > 3000) & (walruses ['gender'] != 'Female')]

     gender  weight  weight_today
name
ET     Male    3400        3550.0

# Ghosts In the Machine

In [58]:
ghosts = pd.DataFrame(index=['Inky', 'Blinky', 'Pinky', 'Sue'],
                                columns = ['dots_eaten', 'pacmen_eaten'])

In [59]:
ghosts

       dots_eaten pacmen_eaten
Inky          NaN          NaN
Blinky        NaN          NaN
Pinky         NaN          NaN
Sue           NaN          NaN

In [60]:
ghosts = ghosts.fillna(0)

In [61]:
ghosts

        dots_eaten  pacmen_eaten
Inky             0             0
Blinky           0             0
Pinky            0             0
Sue              0             0

In [62]:
ghosts.dtypes #returns the data type it is

dots_eaten      int64
pacmen_eaten    int64
dtype: object

In [81]:
import numpy as np

In [82]:
np.random.randint(1,8,(4,2))

array([[2, 6],
       [2, 2],
       [1, 4],
       [4, 3]])

In [83]:
ghosts = pd.DataFrame(np.random.randint(1,8,(4,2)), index=['Inky', 'Blinky', 'Pinky', 'Sue'],
                                columns = ['dots_eaten', 'pacmen_eaten'])

In [84]:
ghosts

        dots_eaten  pacmen_eaten
Inky             2             7
Blinky           2             6
Pinky            5             4
Sue              1             5

In [85]:
import math

In [86]:
ghosts['pacmen_eaten'].apply(math.sqrt)

Inky      2.645751
Blinky    2.449490
Pinky     2.000000
Sue       2.236068
Name: pacmen_eaten, dtype: float64

In [87]:
import math

In [91]:
ghosts['pacmen_eaten'].apply(math.sqrt)

Inky      2.645751
Blinky    2.449490
Pinky     2.000000
Sue       2.236068
Name: pacmen_eaten, dtype: float64

In [92]:
np.sqrt(ghosts['pacmen_eaten'])

Inky      2.645751
Blinky    2.449490
Pinky     2.000000
Sue       2.236068
Name: pacmen_eaten, dtype: float64

# String Methods

In [93]:
walrus_sounds = pd.read_csv('walrus_vocalizations.tsv', sep = '\t', names = ['name', 'sound'])

In [94]:
walrus_sounds

    name             sound
0  Antje       Lound Grunt
1     ET           whistle
2  Jocko        Soft grunt
3  Antje           chortle
4  Antje           Chortle
5     ET  piErCiNG WHistle
6     ET      medium_GRUnT
7  Jocko            BELLOW

In [96]:
walrus_sounds['sound'].apply(str.lower)

0         lound grunt
1             whistle
2          soft grunt
3             chortle
4             chortle
5    piercing whistle
6        medium_grunt
7              bellow
Name: sound, dtype: object

In [97]:
walrus_sounds.dtypes

name     object
sound    object
dtype: object

In [98]:
walrus_sounds['sound'].str.lower

In [99]:
walrus_sounds['sound_lower'] = walrus_sounds['sound'].str.lower()

In [100]:
grunts = walrus_sounds['sound_lower'].str.contains('grunt')

In [105]:
walrus_sounds[grunts]

    name         sound   sound_lower
0  Antje   Lound Grunt   lound grunt
2  Jocko    Soft grunt    soft grunt
6     ET  medium_GRUnT  medium_grunt

In [108]:
walrus_sounds[walrus_sounds['sound'].str.lower().str.contains('grunt')]

    name         sound   sound_lower
0  Antje   Lound Grunt   lound grunt
2  Jocko    Soft grunt    soft grunt
6     ET  medium_GRUnT  medium_grunt